# NOTES DURING CLASS - DAY ONE - CHAPTER 2

In [39]:
import pandas as pd

emp = pd.read_csv('../data/employee.csv', parse_dates=['hire_date'])
emp.head()

,title,dept,salary,race,gender,hire_date
0,POLICE OFFICER,Houston Police Department-HPD,45279.0,White,Male,2015-02-03
1,ENGINEER/OPERATOR,Houston Fire Department (HFD),63166.0,White,Male,1982-02-08
2,SENIOR POLICE OFFICER,Houston Police Department-HPD,66614.0,Black,Male,1984-11-26
3,ENGINEER,Public Works & Engineering-PWE,71680.0,Asian,Male,2012-03-26
4,CARPENTER,Houston Airport System (HAS),42390.0,White,Male,2013-11-04

In [40]:
sal = emp['salary']
sal.head()

0    45279.0
1    63166.0
2    66614.0
3    71680.0
4    42390.0
Name: salary, dtype: float64

In [41]:
len(sal)

1653

# VECTORIZATION - DO NOT NEED A LOOP TO ITERATE

In [43]:
sal + 10000 #adding 10000 in everyone salary

0        55279.0
1        73166.0
2        76614.0
3        81680.0
4        52390.0
5       117962.0
6        54616.0
7        62644.0
8       190416.0
9        40347.0
10       65269.0
11       87076.0
12           NaN
13           NaN
14       91239.0
15       76614.0
16       71506.0
17       67815.0
18       53264.0
19       65437.0
20       62514.0
21       71643.0
22           NaN
23       76614.0
24       91239.0
25       39557.0
26       72540.0
27       38024.0
28       71921.0
29       76614.0
          ...
1623     57996.0
1624     88286.0
1625     75338.0
1626         NaN
1627     76614.0
1628     55279.0
1629     73166.0
1630     87325.0
1631     76614.0
1632     42157.0
1633     55279.0
1634     37914.0
1635     76614.0
1636         NaN
1637     80181.0
1638     65437.0
1639     71921.0
1640     87076.0
1641         NaN
1642     47211.0
1643     40347.0
1644     54429.0
1645     39286.0
1646     91239.0
1647    114455.0
1648     53443.0
1649     76523.0
1650     53443.0
1651     65461.0
1652     61194.0
Name: salary, Length: 1653, dtype: float64

In [17]:
sal ** 2 # root square

0       2.050188e+09
1       3.989944e+09
2       4.437425e+09
3       5.138022e+09
4       1.796912e+09
5       1.165579e+10
6       1.990587e+09
7       2.771391e+09
8       3.254993e+10
9       9.209404e+08
10      3.054662e+09
11      5.940710e+09
12               NaN
13               NaN
14      6.599775e+09
15      4.437425e+09
16      3.782988e+09
17      3.342574e+09
18      1.871774e+09
19      3.073261e+09
20      2.757720e+09
21      3.799859e+09
22               NaN
23      4.437425e+09
24      6.599775e+09
25      8.736162e+08
26      3.911252e+09
27      7.853446e+08
28      3.834210e+09
29      4.437425e+09
            ...
1623    2.303616e+09
1624    6.128698e+09
1625    4.269054e+09
1626             NaN
1627    4.437425e+09
1628    2.050188e+09
1629    3.989944e+09
1630    5.979156e+09
1631    4.437425e+09
1632    1.034073e+09
1633    2.050188e+09
1634    7.791914e+08
1635    4.437425e+09
1636             NaN
1637    4.925373e+09
1638    3.073261e+09
1639    3.834210e+09
1640    5.940710e+09
1641             NaN
1642    1.384659e+09
1643    9.209404e+08
1644    1.973936e+09
1645    8.576698e+08
1646    6.599775e+09
1647    1.091085e+10
1648    1.887294e+09
1649    4.425310e+09
1650    1.887294e+09
1651    3.075923e+09
1652    2.620826e+09
Name: salary, Length: 1653, dtype: float64

In [16]:
sal // 13 # floor division, return the int part

0        3483.0
1        4858.0
2        5124.0
3        5513.0
4        3260.0
5        8304.0
6        3432.0
7        4049.0
8       13878.0
9        2334.0
10       4251.0
11       5928.0
12          NaN
13          NaN
14       6249.0
15       5124.0
16       4731.0
17       4447.0
18       3328.0
19       4264.0
20       4039.0
21       4741.0
22          NaN
23       5124.0
24       6249.0
25       2273.0
26       4810.0
27       2155.0
28       4763.0
29       5124.0
         ...
1623     3692.0
1624     6022.0
1625     5026.0
1626        NaN
1627     5124.0
1628     3483.0
1629     4858.0
1630     5948.0
1631     5124.0
1632     2473.0
1633     3483.0
1634     2147.0
1635     5124.0
1636        NaN
1637     5398.0
1638     4264.0
1639     4763.0
1640     5928.0
1641        NaN
1642     2862.0
1643     2334.0
1644     3417.0
1645     2252.0
1646     6249.0
1647     8035.0
1648     3341.0
1649     5117.0
1650     3341.0
1651     4266.0
1652     3938.0
Name: salary, Length: 1653, dtype: float64

In [18]:
sal % 2 == 0 # modulos operation

0       False
1        True
2        True
3        True
4        True
5        True
6        True
7        True
8        True
9       False
10      False
11       True
12      False
13      False
14      False
15       True
16       True
17      False
18       True
19      False
20       True
21      False
22      False
23       True
24      False
25      False
26       True
27       True
28      False
29       True
        ...
1623     True
1624     True
1625     True
1626    False
1627     True
1628    False
1629     True
1630    False
1631     True
1632    False
1633    False
1634     True
1635     True
1636    False
1637    False
1638    False
1639    False
1640     True
1641    False
1642    False
1643    False
1644    False
1645     True
1646    False
1647    False
1648    False
1649    False
1650    False
1651    False
1652     True
Name: salary, Length: 1653, dtype: bool

In [44]:
sal.between(5000,6000).head()

0    False
1    False
2    False
3    False
4    False
Name: salary, dtype: bool

# DESCRIPTIVE STATISTICS

* Aggregating Methodes - many values -> summarazy all the values in one
    * min
    * max
    * sum
    
* Non-Aggregating Methodes - cannot aggregate (square root for example, need do for each one)
    * round
    * abs
    * cummin
    
    
IN PYTHON you can assign methods to variables

In [21]:
sal.min()

24960.0

In [22]:
sal.max()

210588.0

In [29]:
sal.round(-3).head() #get a series with my numbers rounded

0    45000.0
1    63000.0
2    67000.0
3    72000.0
4    42000.0
Name: salary, dtype: float64

In [32]:
sal.round().head() #values without round

0    45279.0
1    63166.0
2    66614.0
3    71680.0
4    42390.0
Name: salary, dtype: float64

In [34]:
sal.abs().head()

0    45279.0
1    63166.0
2    66614.0
3    71680.0
4    42390.0
Name: salary, dtype: float64

In [36]:
sal.cummin().head() #it is a current minimum, starting from the top

0    45279.0
1    45279.0
2    45279.0
3    45279.0
4    42390.0
Name: salary, dtype: float64

In [38]:
sal.cummax().head() # it is a current maximum, starting from the top)

0    45279.0
1    63166.0
2    66614.0
3    71680.0
4    71680.0
Name: salary, dtype: float64

In [45]:
## Operations on a boolean series

* False is 0
* True is 1

In [46]:
sal_100k = sal>100000
sal_100k.head()

0    False
1    False
2    False
3    False
4    False
Name: salary, dtype: bool

In [49]:
sal_100k.sum() #the number of things that is inside of the criteria

36

In [51]:
sal_100k.mean() #porcentage that meat the criteria

0.021778584392014518

In [52]:
sal_100k.sum() / len(sal_100k) #the mean is the same than this

0.021778584392014518